#Titanic Data Set Analysis

Load the data

In [26]:
import pandas as pd 

data = pd.read_csv('train.csv') # read the data csv file and save it as data
test = pd.read_csv('test.csv') # read the test csv file and save it as test

test_ids = test['PassengerId']

data.head() #returns the first 5 rows of the data set

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Data Exploration

In [27]:
# find out if there are null values in the data 

pd.isnull(data).sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [28]:
# There are alot of null values in the cabin (687) and Age (117). However not as many in embarked(2)
# So we can replace embarked with the letter 'u'

data.Embarked.fillna('U', inplace = True)

pd.isnull(data).sum()

C:\Users\manji\AppData\Local\Temp\ipykernel_8352\2777527806.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data.Embarked.fillna('U', inplace = True)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [29]:
# We should replace the null age values with a median number 

data['Age'].fillna(data['Age'].median(), inplace = True)

pd.isnull(data).sum()

C:\Users\manji\AppData\Local\Temp\ipykernel_8352\1753888945.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(data['Age'].median(), inplace = True)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [30]:
# Cabin doesnt seem to be important to the overall dataset and will need to be dropped 

data = data.drop(['Cabin'], axis=1)

In [31]:
# the data looks abit differnt now but there are some unnecessary columns to the data eg. Name, Ticket and passenger id. So they need to be dropped

data = data.drop(['PassengerId', 'Name', 'Ticket'], axis=1)

In [32]:
#We also need to clean the test data replacing null values and dropping columns

pd.isnull(test).sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [33]:
#cabin column will later be dropped so the focus is on the age and fare column

#replace the null values with a median number 

test['Age'].fillna(data['Age'].median(), inplace = True)

test['Fare'].fillna(data['Fare'].median(), inplace = True)

pd.isnull(test).sum()

C:\Users\manji\AppData\Local\Temp\ipykernel_8352\1289747069.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  test['Age'].fillna(data['Age'].median(), inplace = True)
C:\Users\manji\AppData\Local\Temp\ipykernel_8352\1289747069.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  test['Fare'].fillna(data['Fare'].median(), inplace = True)

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [34]:
#Drop the cabin, passenger id, name and ticket column

test = test.drop(['Cabin', 'PassengerId', 'Name', 'Ticket'], axis=1)

test.head(5)

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [35]:
data.head(10)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S
5         0       3    male  28.0      0      0   8.4583        Q
6         0       1    male  54.0      0      0  51.8625        S
7         0       3    male   2.0      3      1  21.0750        S
8         1       3  female  27.0      0      2  11.1333        S
9         1       2  female  14.0      1      0  30.0708        C

In [36]:
#lets change the data in the sex columns to binary format (1, 0) and embarked 

from sklearn import preprocessing

labelencoder = preprocessing.LabelEncoder()

c = ['Sex', 'Embarked'] #specify the columns to be encoded

#loop to encode the data

for col in c:
    data[col] = labelencoder.fit_transform(data[col])
    test[col] = labelencoder.transform(test[col])

data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

The model

In [37]:
# a simple logistic regression model 

from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

y = data ['Survived']
x = data.drop('Survived', axis=1)

x_train, x_val, y_train, y_val = train_test_split(x, y, test_size=0.2, random_state=42)

In [38]:
Classifier = LogisticRegression(random_state=0, max_iter=10000).fit(x_train, y_train)

In [39]:
predictions = Classifier.predict(x_val)

from sklearn.metrics import accuracy_score

accuracy_score (y_val, predictions)

0.8100558659217877

In [40]:
submission_predictions = Classifier.predict(test)

In [41]:
df = pd.DataFrame({"PassengerId":test_ids.values,
                  'Survived': submission_predictions,
                  })

In [42]:
df.to_csv('Submission.csv', index=False)